QSW2Y/STM32/15、PWMI模式测频率占空比/hardware/IC.c
#include "stm32f10x.h"                  // Device header

void IC_Init(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM3);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period=65536-1;
	TIM_TimeBaseInitStructure.TIM_Prescaler=72-1;
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
	TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);
	
	TIM_ICInitTypeDef TIM_ICInitStructrue;
	TIM_ICInitStructrue.TIM_Channel=TIM_Channel_1;
	TIM_ICInitStructrue.TIM_ICFilter=0xF;
	TIM_ICInitStructrue.TIM_ICPolarity=TIM_ICPolarity_Rising;
	TIM_ICInitStructrue.TIM_ICPrescaler=TIM_ICPSC_DIV1;
	TIM_ICInitStructrue.TIM_ICSelection=TIM_ICSelection_DirectTI;
	TIM_PWMIConfig(TIM3,&TIM_ICInitStructrue);//只支持通道1和通道2配置
	
	TIM_SelectInputTrigger(TIM3,TIM_TS_TI1FP1);//触发源
	TIM_SelectSlaveMode(TIM3,TIM_SlaveMode_Reset);//配置从模式为Reset
	
	TIM_Cmd(TIM3,ENABLE);
}

uint32_t IC_GetFreq(void)//获取频率
{
	return 1000000/(TIM_GetCapture1(TIM3)+1);
}
uint32_t IC_GetDuty(void)//获取占空比
{
	return (TIM_GetCapture2(TIM3)+1)*100/(TIM_GetCapture1(TIM3)+1);
}








